<?php
/**
 * Created by PhpStorm.
 * User: administrator_liwy
 * Date: 2019/5/15
 * Time: 11:18
 */

namespace app\api\controller\v1;


use app\api\controller\v1\common\Index;
use app\api\model\GlAfterSale;
use app\api\model\GlArticleSignUser;
use app\api\model\GlCategory;
use app\api\model\GlGoods;
use app\api\model\GlGoodsSku;
use app\api\model\GlIndexAd;
use app\api\model\GlIntoCount;
use app\api\model\GlOrder;
use app\api\model\GlSearchLog;
use app\api\model\Test1;
use app\api\model\Test2;
use app\api\service\AliPay;
use app\api\service\DES;
use app\api\service\DownloadImage;
use app\api\service\Login\BaseLogin;
use app\api\service\OrderPayment\IcbcTest;
use app\api\service\OrderPayment\PcAliPayment;
use app\api\service\SerAfterSale;
use app\api\service\SerEmail;
use app\api\validate\CurrencyValidate;
use app\lib\exception\CommonException;
use EasyWeChat\Factory;
use Naixiaoxin\ThinkWechat\Facade;
use Noodlehaus\Config;
use think\Controller;
use think\Db;

class Test extends Controller
{
    public function test()
    {
        sleep(3);
        return true;
    }

    private function getOrderInfo()
    {
        $str = '2020-01-08 23:41:52,2020-01-08 23:25:03,2020-01-08 22:56:08,2020-01-08 22:51:27,2020-01-08 22:50:23,2020-01-08 22:39:17,2020-01-08 22:12:55,2020-01-08 22:06:42,2020-01-08 22:05:50,2020-01-08 22:02:23,2020-01-08 21:20:46,2020-01-08 20:59:13,2020-01-08 20:40:37,2020-01-08 19:49:35,2020-01-08 19:31:05,2020-01-08 19:31:05,2020-01-08 19:31:05,2020-01-08 19:31:05,2020-01-08 18:05:04,2020-01-08 17:49:37,2020-01-08 15:52:37,2020-01-08 15:31:39,2020-01-08 15:15:57,2020-01-08 15:09:23,2020-01-08 13:33:30,2020-01-08 12:50:28,2020-01-08 12:13:21,2020-01-08 10:47:01,2020-01-08 10:47:01,2020-01-08 10:47:01,2020-01-08 10:33:27,2020-01-08 09:59:34,2020-01-08 09:58:29,2020-01-08 09:22:32,2020-01-08 07:13:54,2020-01-08 06:45:32,2020-01-08 01:34:20,2020-01-08 00:21:50,2020-01-08 00:00:18,2020-01-07 23:03:58,2020-01-07 22:49:01,2020-01-07 22:39:07,2020-01-07 21:53:48,2020-01-07 21:53:48,2020-01-07 21:53:48,2020-01-07 21:18:24,2020-01-07 21:07:12,2020-01-07 20:53:45,2020-01-07 20:29:13,2020-01-07 19:34:28,2020-01-07 19:09:03,2020-01-07 18:42:23,2020-01-07 17:38:08,2020-01-07 17:36:23,2020-01-07 17:11:56,2020-01-07 16:53:00,2020-01-07 16:51:34,2020-01-07 15:50:40,2020-01-07 14:54:17,2020-01-07 14:54:17,2020-01-07 14:54:17,2020-01-07 14:07:11,2020-01-07 13:58:36,2020-01-07 13:58:36,2020-01-07 13:58:36,2020-01-07 13:58:36,2020-01-07 12:34:47,2020-01-07 12:00:53,2020-01-07 11:51:03,2020-01-07 10:12:19,2020-01-07 08:29:59,2020-01-07 08:17:36,2020-01-07 07:47:58,2020-01-07 07:34:03,2020-01-07 07:25:36,2020-01-07 07:22:14,2020-01-07 06:01:27,2020-01-07 01:57:17,2020-01-07 00:45:40,2020-01-07 00:38:57,2020-01-07 00:14:51,2020-01-06 23:48:12,2020-01-06 23:48:12,2020-01-06 23:48:12,2020-01-06 23:48:12,2020-01-06 23:12:20,2020-01-06 23:12:20,2020-01-06 23:12:20,2020-01-06 23:12:20,2020-01-06 22:50:47,2020-01-06 22:50:05,2020-01-06 22:44:13,2020-01-06 22:20:34,2020-01-06 22:13:23,2020-01-06 22:10:37,2020-01-06 22:10:37,2020-01-06 22:10:37,2020-01-06 22:06:31,2020-01-06 21:48:45,2020-01-06 21:40:38,2020-01-06 21:31:56,2020-01-06 21:30:50,2020-01-06 20:50:00,2020-01-06 20:37:59,2020-01-06 20:35:47,2020-01-06 19:59:54,2020-01-06 19:59:01,2020-01-06 19:52:56,2020-01-06 19:41:37,2020-01-06 19:41:22,2020-01-06 19:17:58,2020-01-06 19:05:01,2020-01-06 19:00:52,2020-01-06 18:31:47,2020-01-06 18:19:58,2020-01-06 18:11:10,2020-01-06 18:11:10,2020-01-06 18:11:10,2020-01-06 18:10:57,2020-01-06 16:46:25,2020-01-06 16:20:57,2020-01-06 15:50:47,2020-01-06 15:02:25,2020-01-06 15:01:39,2020-01-06 14:12:09,2020-01-06 14:12:09,2020-01-06 14:12:09,2020-01-06 14:12:09,2020-01-06 14:12:09,2020-01-06 13:15:50,2020-01-06 13:15:35,2020-01-06 12:59:14,2020-01-06 12:26:38,2020-01-06 11:41:54,2020-01-06 11:35:48,2020-01-06 11:18:28,2020-01-06 11:06:37,2020-01-06 11:06:36,2020-01-06 10:54:32,2020-01-06 10:33:22,2020-01-06 10:33:22,2020-01-06 10:33:22,2020-01-06 10:20:14,2020-01-06 09:13:41,2020-01-06 08:56:57,2020-01-06 08:55:06,2020-01-06 07:06:59,2020-01-06 05:36:00,2020-01-06 02:28:23,2020-01-06 01:35:51,2020-01-06 00:08:08,2020-01-05 23:08:25,2020-01-05 22:37:46,2020-01-05 22:29:53,2020-01-05 22:29:53,2020-01-05 22:29:53,2020-01-05 22:29:53,2020-01-05 22:19:52,2020-01-05 22:09:38,2020-01-05 21:51:01,2020-01-05 21:49:58,2020-01-05 21:46:24,2020-01-05 21:46:24,2020-01-05 21:46:24,2020-01-05 21:39:34,2020-01-05 21:02:39,2020-01-05 21:02:39,2020-01-05 21:02:39,2020-01-05 20:37:51,2020-01-05 20:37:34,2020-01-05 20:20:33,2020-01-05 20:20:33,2020-01-05 20:20:33,2020-01-05 20:20:33,2020-01-05 19:14:42,2020-01-05 19:14:42,2020-01-05 19:14:42,2020-01-05 19:14:42,2020-01-05 17:24:00,2020-01-05 16:52:37,2020-01-05 16:30:52,2020-01-05 16:10:10,2020-01-05 15:43:49,2020-01-05 15:40:03,2020-01-05 15:38:50,2020-01-05 15:38:50,2020-01-05 15:38:50,2020-01-05 15:38:50,2020-01-05 15:29:14,2020-01-05 15:27:30,2020-01-05 15:22:12,2020-01-05 15:22:12,2020-01-05 15:22:12,2020-01-05 15:22:12,2020-01-05 15:22:12,2020-01-05 15:13:49,2020-01-05 14:20:00,2020-01-05 14:16:58,2020-01-05 14:14:41,2020-01-05 13:56:30,2020-01-05 13:53:38,2020-01-05 13:53:10,2020-01-05 13:23:19,2020-01-05 12:56:37,2020-01-05 12:56:37,2020-01-05 12:56:37,2020-01-05 12:55:19,2020-01-05 12:03:04,2020-01-05 11:57:21,2020-01-05 11:52:37,2020-01-05 11:31:30,2020-01-05 11:28:33,2020-01-05 10:10:33,2020-01-05 09:12:53,2020-01-05 07:58:21,2020-01-05 03:35:19,2020-01-05 03:31:26,2020-01-05 02:06:12,2020-01-05 01:38:08,2020-01-05 00:31:49,2020-01-05 00:31:49,2020-01-05 00:31:49,2020-01-05 00:18:15,2020-01-05 00:18:15,2020-01-05 00:18:15,2020-01-04 23:51:07,2020-01-04 22:58:26,2020-01-04 22:21:31,2020-01-04 22:21:31,2020-01-04 22:21:31,2020-01-04 22:21:31,2020-01-04 21:52:46,2020-01-04 21:49:35,2020-01-04 21:49:35,2020-01-04 21:49:35,2020-01-04 21:39:17,2020-01-04 21:13:49,2020-01-04 21:13:09,2020-01-04 20:20:28,2020-01-04 20:15:12,2020-01-04 18:32:36,2020-01-04 18:06:14,2020-01-04 17:41:37,2020-01-04 16:01:11,2020-01-04 15:41:13,2020-01-04 13:53:12,2020-01-04 13:34:04,2020-01-04 13:22:18,2020-01-04 13:07:09,2020-01-04 13:05:15,2020-01-04 12:15:07,2020-01-04 12:15:07,2020-01-04 12:15:07,2020-01-04 12:15:07,2020-01-04 11:03:34,2020-01-04 10:37:20,2020-01-04 10:22:52,2020-01-04 10:16:36,2020-01-04 09:48:04,2020-01-04 09:05:28,2020-01-04 08:49:09,2020-01-04 08:49:09,2020-01-04 08:49:09,2020-01-04 07:52:39,2020-01-04 07:52:39,2020-01-04 07:52:39,2020-01-04 00:55:35,2020-01-04 00:55:35,2020-01-04 00:55:35,2020-01-04 00:21:29,2020-01-04 00:16:49,2020-01-04 00:14:54,2020-01-03 22:39:05,2020-01-03 21:47:38,2020-01-03 19:23:02,2020-01-03 16:09:16,2020-01-03 13:08:01,2020-01-03 12:12:58,2020-01-03 11:58:49,2020-01-03 10:24:10,2020-01-03 09:24:43,2020-01-03 08:10:00,2020-01-03 00:21:12,2020-01-03 00:01:23,2020-01-02 23:55:54,2020-01-02 23:47:48,2020-01-02 23:47:48,2020-01-02 23:47:48,2020-01-02 23:47:48,2020-01-02 23:12:03,2020-01-02 23:11:57,2020-01-02 22:58:22,2020-01-02 22:56:39,2020-01-02 22:46:38,2020-01-02 22:43:00,2020-01-02 22:37:06,2020-01-02 22:25:27,2020-01-02 18:57:51,2020-01-02 18:57:51,2020-01-02 18:57:51,2020-01-02 18:57:51,2020-01-02 18:13:56,2020-01-02 18:01:50,2020-01-02 17:41:46,2020-01-02 17:35:04,2020-01-02 17:35:04,2020-01-02 17:35:04,2020-01-02 14:44:48,2020-01-02 14:34:34,2020-01-02 14:28:58,2020-01-02 14:28:00,2020-01-02 12:59:24,2020-01-02 12:44:54,2020-01-02 11:49:00,2020-01-02 11:37:10,2020-01-02 10:56:40,2020-01-02 10:08:36,2020-01-02 02:34:03,2020-01-02 00:13:24,2020-01-01 22:31:15,2020-01-01 22:20:27,2020-01-01 21:45:43,2020-01-01 18:09:45,2020-01-01 18:09:45,2020-01-01 18:09:45,2020-01-01 15:19:28,2020-01-01 14:27:57,2020-01-01 11:27:15,2020-01-01 01:38:24,2019-12-31 16:53:51,2019-12-31 16:28:01,2019-12-31 16:20:42,2019-12-31 14:19:23,2019-12-31 14:11:20,2019-12-31 14:09:30,2019-12-31 11:04:12,2019-12-31 00:17:22,2019-12-30 23:09:15,2019-12-30 20:36:24,2019-12-30 13:54:27,2019-12-30 13:54:27,2019-12-30 12:45:14,2019-12-30 12:08:51,2019-12-30 08:39:08,2019-12-29 22:07:54,2019-12-29 21:06:13,2019-12-29 14:47:51,2019-12-29 14:19:18,2019-12-29 12:17:16,2019-12-29 10:19:53,2019-12-28 21:38:35,2019-12-28 18:32:39,2019-12-28 17:28:42,2019-12-28 15:23:01,2019-12-28 14:57:19,2019-12-27 17:03:18,2019-12-27 00:44:41,2019-12-26 23:03:10,2019-12-26 17:47:53,2019-12-26 14:09:05,2019-12-25 22:09:43,2019-12-25 21:20:27,2019-12-25 21:20:27,2019-12-25 21:20:27,2019-12-25 21:20:27,2019-12-25 20:48:58,2019-12-25 17:22:00,2019-12-25 17:22:00,2019-12-25 17:22:00,2019-12-25 16:14:00,2019-12-25 13:46:43,2019-12-25 13:46:43,2019-12-25 13:46:43,2019-12-25 11:59:05,2019-12-25 11:08:12,2019-12-24 20:53:26,2019-12-24 17:08:59,2019-12-24 16:21:27,2019-12-24 16:21:27,2019-12-24 16:21:27,2019-12-24 16:21:27,2019-12-24 16:17:53,2019-12-24 14:25:40,2019-12-23 23:23:26,2019-12-23 19:57:15,2019-12-23 13:41:35,2019-12-23 10:53:48,2019-12-23 10:00:37,2019-12-22 23:55:51,2019-12-22 18:21:24,2019-12-22 16:48:41,2019-12-22 16:48:41,2019-12-22 16:48:41,2019-12-22 15:59:22,2019-12-22 15:01:49,2019-12-22 00:03:43,2019-12-21 23:46:42,2019-12-21 21:16:51,2019-12-21 15:01:29,2019-12-21 15:01:29,2019-12-21 15:01:29,2019-12-21 15:01:29,2019-12-21 10:57:52,2019-12-21 10:57:52,2019-12-21 10:57:52,2019-12-21 10:57:52,2019-12-21 10:57:52,2019-12-20 20:19:58,2019-12-20 18:36:51,2019-12-20 15:03:18,2019-12-20 14:41:16,2019-12-20 13:57:45,2019-12-20 13:37:22,2019-12-19 18:40:18,2019-12-19 07:17:24,2019-12-19 07:17:24,2019-12-19 07:17:24,2019-12-19 07:17:24,2019-12-18 23:11:15,2019-12-18 22:39:57,2019-12-18 21:20:12,2019-12-18 17:27:53,2019-12-18 17:27:53,2019-12-18 17:27:53,2019-12-18 17:27:53,2019-12-18 16:40:47,2019-12-18 16:26:11,2019-12-18 15:32:04,2019-12-18 12:26:04,2019-12-17 21:58:26,2019-12-17 18:09:39,2019-12-17 14:35:44,2019-12-17 11:28:47,2019-12-17 10:47:48,2019-12-17 07:59:10,2019-12-16 20:35:39,2019-12-16 20:26:42,2019-12-16 20:26:42,2019-12-16 20:26:42,2019-12-16 20:26:42,2019-12-16 18:19:35,2019-12-16 16:01:44,2019-12-16 14:36:35,2019-12-16 14:25:21,2019-12-16 13:51:59,2019-12-16 11:26:45,2019-12-16 11:26:45,2019-12-16 11:26:45,2019-12-16 10:56:32,2019-12-16 09:49:46,2019-12-16 09:49:46,2019-12-16 09:49:46,2019-12-15 23:09:36,2019-12-15 23:09:36,2019-12-15 23:09:36,2019-12-15 17:25:32,2019-12-15 13:18:23,2019-12-15 12:41:55,2019-12-15 12:41:30,2019-12-15 12:40:56,2019-12-15 12:34:34,2019-12-15 09:49:38,2019-12-15 09:49:38,2019-12-15 09:49:38,2019-12-14 22:19:04,2019-12-14 22:01:21,2019-12-14 19:16:52,2019-12-14 16:25:08,2019-12-14 03:09:44,2019-12-13 22:32:35,2019-12-13 22:19:37,2019-12-13 22:19:37,2019-12-13 22:19:37,2019-12-13 18:17:30,2019-12-13 14:04:11,2019-12-12 23:15:32,2019-12-12 23:07:51,2019-12-12 22:51:13,2019-12-12 22:51:13,2019-12-12 22:51:13,2019-12-12 22:51:13,2019-12-12 22:40:57,2019-12-12 21:57:20,2019-12-12 19:18:26,2019-12-12 19:00:46,2019-12-12 17:59:23,2019-12-12 17:59:23,2019-12-12 17:59:23,2019-12-12 16:26:07,2019-12-12 16:18:15,2019-12-12 14:52:56,2019-12-12 14:52:56,2019-12-12 14:52:56,2019-12-12 14:35:36,2019-12-12 09:49:59,2019-12-12 09:17:27,2019-12-12 08:36:06,2019-12-12 08:33:23,2019-12-12 06:47:31,2019-12-12 05:32:31,2019-12-12 00:59:23,2019-12-12 00:32:55,2019-12-12 00:16:24,2019-12-12 00:11:25,2019-12-12 00:05:37,2019-12-12 00:05:37,2019-12-12 00:05:37,2019-12-12 00:05:37,2019-12-12 00:03:27,2019-12-12 00:02:33,2019-12-12 00:02:13,2019-12-12 00:00:19,2019-12-11 23:55:02,2019-12-11 23:55:02,2019-12-11 23:55:02,2019-12-11 23:55:02,2019-12-11 22:55:27,2019-12-11 20:53:59,2019-12-11 13:53:39,2019-12-11 09:43:52,2019-12-11 09:43:52,2019-12-11 09:43:52,2019-12-11 00:13:31,2019-12-10 16:10:13,2019-12-10 13:41:32,2019-12-09 12:20:48,2019-12-09 08:45:33,';
        $arr = explode(',', $str);//转成数组
        $arr_day_time = [];
        $arr_week = [];
        foreach ($arr as $k => $v) {
            $timestamp = strtotime($v);
            $h = date('H', $timestamp);
            if (array_key_exists($h, $arr_day_time)) {
                $arr_day_time[$h]++;
            } else {
                $arr_day_time[$h] = 1;
            }
        }
        arsort($arr_day_time);
        foreach ($arr as $k => $v) {
            $timestamp = strtotime($v);
            $h = date('D', $timestamp);
            if (array_key_exists($h, $arr_week)) {
                $arr_week[$h]++;
            } else {
                $arr_week[$h] = 1;
            }
        }

        arsort($arr_week);


        foreach ($arr_week as $k2 => $v2) {
            $arr_week_time[$k2] = [];
            foreach ($arr as $k => $v) {
                $timestamp = strtotime($v);
                $h = date("D H", $timestamp);
                if (stristr($h, $k2)) {
                    if (array_key_exists($h, $arr_week_time[$k2])) {
                        $arr_week_time[$k2][$h]++;
                    } else {
                        $arr_week_time[$k2][$h] = 1;
                    }
                }

            }
            arsort($arr_week_time[$k2]);
        }

        $str = '苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 银色 mini5-64G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 金色 WLAN版 64G,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 44毫米,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G WIFI版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI 【壳膜 +倍思数据线,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,倍思简捷二合一便携款数据线（安卓/苹果）颜色随机发货，以实物为准,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 40毫米,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款金色铝金属表壳+粉砂色运动型表带 40毫米,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-64G-WLAN 【皮套+膜】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 7.9英寸,ipad平板钢化膜(以收到实物为准)赠品 7.9英寸,【6期免息】苹果（Apple）iPad 2018年新款 ipad pro 11英寸平板电脑 银色 64G WLAN版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,苹果（Apple） 【6期免息】苹果Watch Series 5智能手表5代 银色铝金属表壳+白色运动型表带 -GPS版 40毫米,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-64G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 银色 mini5-64G-WLAN 【皮套+膜】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 7.9英寸,ipad平板钢化膜(以收到实物为准)赠品 7.9英寸,苹果（Apple） 【6期免息】苹果Watch Series 5智能手表5代 深空灰色铝金属表壳+黑色运动型表带 -GPS版 44毫,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】苹果Watch Series 5智能手表5代 深空灰色铝金属表壳+黑色运动型表带 -GPS版 44毫,苹果（Apple） 【6期免息】苹果Watch Series 5智能手表5代 银色铝金属表壳+白色运动型表带 -GPS版 44毫米,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-64G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】2019新款 AirPods Pro 无线苹果蓝牙耳机 白色 AirPods Pro（无线充电）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 128G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）MacBook Air苹果笔记本电脑 13.3英寸 轻薄本 i5+8GB内存+128GB闪存【D32】,电脑配件（赠品）以实际到货为准 鼠标垫,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 18款32G-WLAN【倍思数据线+皮套+,倍思简捷二合一便携款数据线（安卓/苹果）颜色随机发货，以实物为准,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,【6期免息】苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 深空灰 WLAN版 64G,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款银色铝金属表壳+海贝色回环式运动型表带 40,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 32G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 深空灰 WLAN版 64G,【6期免息】苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 金色 WLAN版 64G,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 44毫米,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI 【壳膜  + 原装笔】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI 【壳膜  + 原装笔】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 32G WIFI版,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 32G-WLAN版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 32G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）MacBook Air13.3英寸轻薄笔记本电脑2019新款 深空灰色 i5+8GB内存+256GB闪存【19,电脑配件（赠品）以实际到货为准 鼠标垫,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 银色 mini5-64G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 深空灰 2018款 128G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 32G WIFI版,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 40毫米,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款银色铝金属表壳+白色运动型表带 40毫米,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G WIFI版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,苹果（Apple） 原装Magic Mouse 2代无线蓝牙鼠标 白色 白色/MLA02CH/A,邮费补差专用（请勿乱拍） 红色,【6期免息】苹果（Apple）2019款 Macbook Pro 15.4【带触控栏】 笔记本电脑 九代六核i7/16G/256G银色MV922C,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 15.4英寸,电脑配件（赠品）以实际到货为准 鼠标垫,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 金色 WLAN版 64G,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 128G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）MacBook Air苹果笔记本电脑 13.3英寸 轻薄本 i5+8GB内存+128GB闪存【D32】,电脑配件（赠品）以实际到货为准 鼠标垫,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI 【壳膜  + 原装笔】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 2018年新款 ipad pro 11英寸平板电脑 深空灰 256GB WLAN版,【6期免息】苹果（Apple） MacBook Pro 13.3英寸2019年新款笔记本电脑 19款八代i5/8G/512G银色MV9A2CH,电脑配件（赠品）以实际到货为准 鼠标垫,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G-WIFI [皮套+钢化膜],苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,苹果（Apple） 【6期免息】2019新款 AirPods Pro 无线苹果蓝牙耳机 白色 AirPods Pro（无线充电）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 128G WIFI 【壳膜  + 原装笔,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 18款128G-WLAN【倍思数据线+皮套,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 深空灰 18款128G-WLAN【倍思数据线+皮,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),【6期免息】苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 金色 WLAN版 64G,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 32G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (二代),【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-64G 插卡版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G-WIFI  [皮套+钢化膜 ],苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 128G-WIFI [皮套+钢化膜],苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G-WIFI  [皮套+钢化膜 ],苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI 【壳膜 +倍思数据线,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G-WIFI  [皮套+钢化膜 ],苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款金色铝金属表壳+粉砂色运动型表带 40毫米,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,【6期免息】苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 深空灰 WLAN版 256G,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 44毫米,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款银色铝金属表壳+白色运动型表带 40毫米,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 32G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 128G WIFI 【壳膜  + 原装笔,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 32G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 32G WIFI版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G-WIFI [皮套+钢化膜],苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 银色 18款128G-WLAN【皮套+钢化膜】,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G-WIFI [皮套+钢化膜],苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 128G-WLAN版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】2019新款 AirPods Pro 无线苹果蓝牙耳机 白色 AirPods Pro（无线充电）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI版,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 银色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 深空灰 18款128GWLAN版【原装笔+钢化,【6期免息】ApplePencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 深空灰 WLAN版 64G,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI 【壳膜 +倍思数据线,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 40毫米,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【6期免息】苹果（Apple）2019款 Macbook Pro 15.4【带触控栏】 笔记本电脑 九代八核i9/16G/512G灰色MV912C,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,电脑配件（赠品）以实际到货为准 鼠标垫,苹果（Apple） 【6期免息】新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 银色 mini5-64G-WLAN版,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 32G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-256G 插卡版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G WIFI版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-64G-WLAN版,【6期免息】苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 银色 WLAN版 64G,苹果（Apple） 【6期免息】Watch Series 4代 苹果智能手表 GPS款银色铝金属表壳+白色运动型表带 40毫米,【6期免息】苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G WIFI版,【6期免息】苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-256G-WLAN 【皮套+膜】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 7.9英寸,ipad平板钢化膜(以收到实物为准)赠品 7.9英寸,【6期免息】苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 银色 2018款 32G-WLAN版,苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-256G 插卡版,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 44毫米,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款金色铝金属表壳+粉砂色运动型表带 40毫米,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 银色 2018款 128G-WLAN版,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 苹果Watch Series 5智能手表5代 深空灰色铝金属表壳+黑色运动型表带-蜂窝数据版 40毫米,苹果（Apple） 苹果Watch Series 5智能手表5代 深空灰色铝金属表壳+黑色运动型表带-蜂窝数据版 40毫米,苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款银色铝金属表壳+白色运动型表带 40毫米,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款银色铝金属表壳+白色运动型表带 40毫米,苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 128G WIFI版,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 44毫米,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款银色铝金属表壳+白色运动型表带 40毫米,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）Pencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),苹果（Apple） Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 40毫米,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-256G 插卡版,苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-64G 插卡版,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）MacBook Air苹果笔记本电脑 13.3英寸 轻薄本 MQD32CH/A+原装鼠标,电脑配件（赠品）以实际到货为准 鼠标垫,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,苹果原装无线鼠标 白色,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）iPad 2018新款 iPad Pro 12.9英寸平板电脑 银色 512G WLAN版 【皮套+钢化膜】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 12.9英寸,ipad平板钢化膜(以收到实物为准)赠品 12.9英寸,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 44毫米,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 18款128G-WLAN【皮套+钢化膜】,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,邮费补差专用（请勿乱拍） 红色,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 银色 128G WIFI 【壳膜 +倍思数据线】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 苹果Watch Series 5智能手表5代 金色铝金属表壳+粉砂色运动型表带 - -GPS版 44毫米,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）MacBook Air苹果笔记本电脑 13.3英寸 轻薄本 i5+8GB内存+128GB闪存【D32】,电脑配件（赠品）以实际到货为准 鼠标垫,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款深空灰色铝金属表壳+黑色运动型表带 40毫米,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 128G WIFI 【壳膜 +倍思数据线】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,邮费补差专用（请勿乱拍） 红色,苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 128G WIFI 【壳膜 +倍思数据线】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 128G-WLAN版,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 深空灰色 mini5-64G-WLAN版,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 深空灰 18款128GWLAN版【原装笔+钢化膜+皮套】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果（Apple）Pencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 18款128GWLAN版【原装笔+钢化膜+皮套】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果（Apple）Pencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 128G-WLAN版,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款银色铝金属表壳+白色运动型表带 40毫米,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）Pencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (二代),苹果（Apple）iPad 2018年新款 ipad pro 11英寸平板电脑 深空灰 64G WLAN+Cellular版,苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 深空灰 128G WIFI 【壳膜 +倍思数据线】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2 英寸,ipad平板钢化膜(以收到实物为准)赠品 10.2 英寸,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 银色 2018款 128G-WLAN版,苹果（Apple）MacBook Air苹果笔记本电脑 13.3英寸 轻薄本 MQD32CH/A+原装鼠标,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,电脑配件（赠品）以实际到货为准 鼠标垫,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）MacBook air 电脑笔记本13.3英寸2018新款轻薄本 深空灰 i5+8GB内存+128GB闪存,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,电脑配件（赠品）以实际到货为准 鼠标垫,苹果（Apple）ipad air3 2019年新款苹果平板电脑 10.5英寸 金色 WLAN版 64G 【皮套+钢化膜】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.5英寸,ipad平板钢化膜(以收到实物为准)赠品 10.5英寸,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,邮费补差专用（请勿乱拍） 红色,邮费补差专用（请勿乱拍） 红色,邮费补差专用（请勿乱拍） 红色,邮费补差专用（请勿乱拍） 红色,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 银色 2018款 128G-WLAN版,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 18款128G-WLAN【皮套+钢化膜】,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）MacBook Air苹果笔记本电脑 13.3英寸 轻薄本 i5+8GB内存+128GB闪存【D32】,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,电脑配件（赠品）以实际到货为准 鼠标垫,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） Watch Series 4代 苹果智能手表 GPS款银色铝金属表壳+白色运动型表带 40毫米,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 18款32G-WLAN【倍思数据线+皮套+钢化膜】,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 32G WIFI版,邮费补差专用（请勿乱拍） 红色,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 128G-WLAN版,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）MacBook Air苹果笔记本电脑 13.3英寸 轻薄本 i5+8GB内存+128GB闪存【D32】,苹果电脑包 macbook air13  pro13 pro15 笔记本内胆包【赠品】以实物为准 13.3英寸,电脑配件（赠品）以实际到货为准 鼠标垫,苹果（Apple）iPad 2018新款 iPad Pro 12.9英寸平板电脑 银色 512G WLAN版 【皮套+钢化膜】,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 18款128G-WLAN【皮套+钢化膜】,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,【新款】苹果（Apple）MacBookPro16英寸苹果笔记本电脑【带触控栏】视网膜显示屏 19款6核/9代/i7/16G/512G,苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 128G-WLAN版,苹果（Apple）2019新款 ipad mini5 苹果平板电脑 7.9英寸 金色 mini5-64G-WLAN版+倍思数据线+壳膜,ipad平板钢化膜(以收到实物为准)赠品 10.2,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 10.2,倍思简捷二合一便携款数据线（安卓/苹果）以实物为准,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）iPad 平板电脑 2019年新款10.2英寸 air更新版 金色 128G WIFI版,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款32GWLAN【原装笔+钢化膜+皮套】,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果（Apple）Pencil 原装触控手写笔 iPad pro触控笔适用于ipad一代/二代 Apple Pencil (一代),苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 2018款 128G-WLAN版,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple）ipad2018 苹果平板电脑 2018年新款 9.7英寸 金色 18款128G-WLAN【皮套+钢化膜】,ipad平板钢化膜(以收到实物为准)赠品 9.7英寸,苹果 iPad 平板电脑保护套/保护壳 (以收到实物为准) 9.7英寸,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（无线充电盒版）,苹果（Apple） 新款AirPods2/AirPods 无线蓝牙耳机 官方标配 AirPods2（有线充电盒版）,';
        $arr = explode(',', $str);//转成数组
        $arr_goods_name = [];
        foreach ($arr as $k => $v) {
            if (array_key_exists($v, $arr_goods_name)) {
                $arr_goods_name[$v]++;
            } else {
                $arr_goods_name[$v] = 1;
            }
        }
        arsort($arr_goods_name);
        return ["day_time" => $arr_day_time, "week" => $arr_week, "week_time" => $arr_week_time, "goods_name" => $arr_goods_name];
    }

    private function getAliPayUserInfo()
    {
        $AliPay = new AliPay();

        $oauth_token_result = $AliPay->oauthToken('2c65b24b77554c1482f0f98ab017YX40');

        return $AliPay->userInfoShare($oauth_token_result['alipay_system_oauth_token_response']['access_token']);
    }

    /**
     * des加密
     */
    private function des()
    {
        $key = 'u1BvOHzUOcklgNpn1MaWvdn9DT4LyzSX';
        $iv = '12345678';
        // DES CBC 加解密
        $des = new DES($key, 'DES-CBC', DES::OUTPUT_BASE64, $iv);
        $base64Sign = $des->encrypt('Hello DES CBC');
        $des->decrypt($base64Sign);
        // DES ECB 加解密
        $des = new DES($key, 'DES-ECB', DES::OUTPUT_HEX);
        $base64Sign = $des->encrypt('Hello DES ECB');
        $des->decrypt($base64Sign);
    }

    /**
     * @return bool
     * @throws CommonException
     * @throws \think\db\exception\DataNotFoundException
     * @throws \think\db\exception\ModelNotFoundException
     * @throws \think\exception\DbException
     *创建zip
     */
    private function createZip()
    {
        /*获取数据*/
        $index_ad_date = GlIndexAd::giveIndexAdListByIntoType('tmt_mobile')->toArray();
        /*将图片添加到zip*/
        $zip = new \ZipArchive();
        if ($zip->open(config('my_config.public_file') . time() . rand(100, 999) . '.zip', \ZipArchive::CREATE) !== TRUE) {
            throw new CommonException(['msg' => '无效zip路径']);
        }
        if (is_array($index_ad_date)) {
            foreach ($index_ad_date as $key => $value) {
                $img_name = str_replace(config('my_config.img_url'), '', $value['ad_img']);
                $img_file = config('my_config.img_file') . $img_name;
                if (file_exists($img_file)) {
                    $zip->addFile($img_file, 'images/' . $img_name);
                    $index_ad_date[$key]['ad_img'] = './images/' . $img_name;
                }

            }
        }
        /*生成js文件*/
        $data_js_name = config('my_config.public_file') . "temp/data" . time() . rand(100, 999) . ".js";
        $data_js = fopen($data_js_name, "w");
        fwrite($data_js, "var data = '" . json_encode($index_ad_date, JSON_UNESCAPED_SLASHES | JSON_UNESCAPED_UNICODE) . "';");
        fclose($data_js);
        $zip->addFile($data_js_name, 'js/data.js');
        $zip->close();
        //删除临时js
        if (file_exists($data_js_name)) {
            unlink($data_js_name);
        }
        return true;
    }

    /**
     * @return string
     */
    private function sendEmailTest()
    {

        $head = '测试';
        $email_body = '用户支付成功:';
        $v['goods_name'] = 'asdasdsa';
        $v['goods_id'] = 'asdasdsa';
        $v['goods_number'] = 10;
        $v['sku_id'] = 'asdasdsa';
        $v['sku_desc'] = 'asdasdsa';
        $sku_info['sku_stock'] = 10;
        $email_body .= '
            (商品名称:' . $v['goods_name'] .
            ',商品id:' . $v['goods_id'] .
            ',购买数量:' . $v['goods_number'] .
            ',SkuId:' . $v['sku_id'] .
            ',属性详情:' . $v['sku_desc'] .
            ',剩余库存:' . ($sku_info['sku_stock'] - $v['goods_number']) .
            ',库存检测结果:库存充足)';

        $address_array = ['987303897@qq.com', '582870246@qq.com'];

        (new SerEmail())->sendEmail($head, $email_body, $address_array);

        return $email_body;

    }

    /**
     * @return string
     * 工行测试
     */
    public function ghTest()
    {
        $tranData = array(
            'interfaceName' => 'ICBC_WAPB_B2C',
            'interfaceVersion' => '1.0.0.6',
            'orderInfo' => array(
                'orderDate' => date('YmdHis', time()),
                'orderid' => 'orderid',
                'amount' => '1000',
                'installmentTimes' => '9000',
                'curType' => '001',
                'merID' => '1103EE20175012',//商户代码
                'merAcct' => '1103028809200994418',//商户账号
            ),
            'custom' => array(
                'verifyJoinFlag' => 0,
                'Language' => '',
            ),
            'message' => array(
                'goodsID' => '',
                'goodsName' => '商品名称',
                'goodsNum' => 1,
                'carriageAmt' => '',
                'merHint' => '',
                'remark1' => '',
                'remark2' => '',
                'merURL' => "回调地址",
                'merVAR' => 'test',
                'notifyType' => 'HS',
                'resultType' => '0',
            ),
        );
        $xml = self::coverParamsToXml($tranData);
        $htmlParams = array(
            'tranData' => 'tranData',
            'merSignMsg' => 'merSignMsg',
            'merCert' => 'merCert',
            'clientType' => 'clientType'
        );
        $xml = self::createHtml($htmlParams);
        return $xml;
    }

    /**
     * @param $params
     * @return string
     * 工行转xml
     */
    public static function coverParamsToXml($params)
    {
        $sign_str = '<?xml version="1.0" encoding="GBK" standalone="no"?>';
        $sign_str .= '<B2CReq>';
        foreach ($params as $key => $val) {
            if (!is_array($val)) {
                $sign_str .= sprintf('<%s>%s</%s>', $key, $val, $key);
            } else {
                $sign_str .= '<' . $key . '>';
                foreach ($val as $key2 => $val2) {
                    if (!is_array($val2)) {
                        $sign_str .= sprintf('<%s>%s</%s>', $key2, $val2, $key2);
                    } else {
                        $sign_str .= '<' . $key2 . '>';
                        if ($key2 == 'subOrderInfoList') {
                            foreach ($val2 as $key3 => $val3) {
                                if (is_array($val3) && is_numeric($key3)) {
                                    $sign_str .= '<' . 'subOrderInfo' . '>';
                                    foreach ($val3 as $key4 => $val4) {
                                        $sign_str .= sprintf('<%s>%s</%s>', $key4, $val4, $key4);
                                    }
                                    $sign_str .= '</' . 'subOrderInfo' . '>';
                                }
                            }
                        }
                        $sign_str .= '</' . $key2 . '>';
                    }
                }

                $sign_str .= '</' . $key . '>';
            }
        }
        $sign_str .= '</B2CReq>';
        return strval($sign_str);
    }

    /**
     * @param $params
     * @return string
     * 工行转HTML
     */
    public static function createHtml($params)
    {
        $init = array(
            'interfaceName' => 'ICBC_WAPB_B2C',
            'interfaceVersion' => '1.0.0.6'
        );
        $params = array_merge($init, $params);
        $action = 'https://mywap2.icbc.com.cn/ICBCWAPBank/servlet/ICBCWAPEBizServlet';

        $encodeType = isset ($params ['encoding']) ? $params ['encoding'] : 'UTF-8';
        $var = '';
        $html = <<<eot
<html>
<head>
    <meta http-equiv="Content-Type" content="text/html; charset={$encodeType}" />
</head>
<body  onload="javascript:document.pay_form.submit();">
    <form id="pay_form" name="pay_form" action="{$action}" method="post">
eot;
        foreach ($params as $key => $value) {
            $html .= "    <input type=\"hidden\" name=\"{$key}\" id=\"{$key}\" value=\"{$value}\" />\n";
            $var .= $key . ':' . $value . "\n";
        }
        $html .= <<<eot
    <input type="submit" value="稍等，支付跳转跳..." style="display: none;" >
    </form>
</body>
</html>
eot;
        file_put_contents('test.txt', $html);
        return $html;
    }

    protected function iniTest()
    {
        $conf = Config::load('C:\Users\administrator_liwy\Desktop\web\API\ganglonggou-api\main\application\api\controller\v1\test.ini');

        $conf['MerchantKeyStoreType'] = '1';

        return $conf->get('MerchantKeyStoreType');
    }

    private function returnHtmlTest()
    {

        $goods_list['g1'] = GlIndexAd::where([
            'into_type' => '3c618pc',
            'position_type' => '券享最惠，品悦好物-商品',
        ])
            ->order(['position_type', 'sort_order' => 'desc'])
            ->select();
        $goods_list['g2'] = GlIndexAd::where([
            'into_type' => '3c618pc',
            'position_type' => '手机数码专区',
            'position_type2' => '内容',
        ])
            ->order(['position_type', 'sort_order' => 'desc'])
            ->select();
        $goods_list['g3'] = GlIndexAd::where([
            'into_type' => '3c618pc',
            'position_type' => '电脑办公专区',
            'position_type2' => '内容',
        ])
            ->order(['position_type', 'sort_order' => 'desc'])
            ->select();

        $test = view('/3cPc')->assign('goods_list', $goods_list);

        return $test;

    }

    /**
     * @return array
     * @throws \think\Exception
     * @throws \think\db\exception\DataNotFoundException
     * @throws \think\db\exception\ModelNotFoundException
     * @throws \think\exception\DbException
     * @throws \think\exception\PDOException
     * 手动删除重复的sku
     */
    private function delSku()
    {
        $goods_array = GlGoods::where(['is_del' => 0])
            ->field('goods_id,market_price,shop_price,attribute')
            ->select()
            ->toArray();
        $del_suk_count = [];//需要删除的sku数组
        foreach ($goods_array as $index => $goods_info) {
            $goods_sku_info_array = GlGoodsSku::where(['goods_id' => $goods_info['goods_id']])->select()->toArray();
            if (count($this->get2DRepeat($goods_sku_info_array, ['sku_desc'])) > 0) {
                array_push($del_suk_count, ['goods_id' => $goods_info['goods_id'], $this->get2DRepeat($goods_sku_info_array, ['sku_desc'])]);
            }
        }

        //开始删除重复的sku
        foreach ($del_suk_count as $k => $v) {
            foreach ($v[0] as $k2 => $v2) {
                GlGoodsSku::where(['goods_id' => $v['goods_id'], 'sku_id' => $v2['sku_id']])
                    ->delete();
            }

        }
        return $del_suk_count;
    }

    /**
     * @return bool
     * @throws \think\db\exception\DataNotFoundException
     * @throws \think\db\exception\ModelNotFoundException
     * @throws \think\exception\DbException
     * 手动添加sku
     */
    private function addSku()
    {
        $goods_array = GlGoods::where(['is_del' => 0])
            ->field('goods_id,market_price,shop_price,attribute')
            ->select()
            ->toArray();
        $count = 0;
        foreach ($goods_array as $index => $goods_info) {
            $attribute = $goods_info['attribute'];
            $attribute_array = [];
            foreach ($attribute as $k => $v) {
                array_push($attribute_array, $v['attribute_value']);
            }

            $sku_array_ = $this->dikaer($attribute_array);

            $sku_info = GlGoodsSku::where(['goods_id' => $goods_info['goods_id']])
                ->order('sku_id')
                ->select()
                ->toArray();

            $sku_array = [];
            foreach ($sku_info as $k => $v) {
                array_push($sku_array, $v['sku_desc']);
            }

            $sku_desc_array = array_merge(array_diff($sku_array_, $sku_array), array_diff($sku_array, $sku_array_));


            if (count($sku_desc_array) > 0) {
                foreach ($sku_desc_array as $index2 => $value2) {
                    $data['goods_id'] = $goods_info['goods_id'];
                    $data['sku_stock'] = 0;
                    $data['sku_shop_price'] = $goods_info['shop_price'];
                    $data['sku_market_price'] = $goods_info['market_price'];
                    $data['goods_id'] = $goods_info['goods_id'];
                    $data['give_integral'] = 0;
                    $data['integral'] = 0;
                    $data['img_url'] = removeImgUrl($sku_info[0]['img_url']);
                    $data['original_img_url'] = removeImgUrl($sku_info[0]['original_img_url']);
                    $data['sku_desc'] = $value2;
                    GlGoodsSku::create($data);
                    $count++;
                }

            }

        }

        return $count;

    }

    /**
     * @param $arr
     * @return array|mixed
     * 笛卡乘积
     */
    private function dikaer($arr)
    {
        //$arr1 = array();
        $result = array_shift($arr);
        while ($arr2 = array_shift($arr)) {
            $arr1 = $result;
            $result = array();
            foreach ($arr1 as $v) {
                foreach ($arr2 as $v2) {
                    $result[] = $v . ',' . $v2;
                }
            }
        }
        return $result;
    }


    /**
     * @param $arr
     * @return array
     * 获取数组重复项
     */
    private function getRepeat($arr)
    {
        // 获取去掉重复数据的数组
        $unique_arr = array_unique($arr);
        // 获取重复数据的数组
        $repeat_arr = array_diff_assoc($arr, $unique_arr);

        return $repeat_arr;
    }

    /**
     * @param $arr
     * @param $keys
     * @return array
     * 2维数组重复项
     */
    private function get2DRepeat($arr, $keys)
    {
        $unique_arr = array();
        $repeat_arr = array();
        foreach ($arr as $k => $v) {
            $str = "";
            foreach ($keys as $a => $b) {
                $str .= "{$v[$b]},";
            }
            if (!in_array($str, $unique_arr)) {
                $unique_arr[] = $str;
            } else {
                $repeat_arr[] = $v;
            }
        }
        return $repeat_arr;
    }

    /**
     * @param $arr
     * @param $key
     * @return mixed
     * 根据键删除数组项
     */
    private function byKeyrRemoveArrVal($arr, $key)
    {
        if (!array_key_exists($key, $arr)) {
            return $arr;
        }
        $keys = array_keys($arr);
        $index = array_search($key, $keys);
        if ($index !== FALSE) {
            array_splice($arr, $index, 1);
        }
        return $arr;
    }

    /**
     * @return bool
     * 事务测试
     */
    private function testDb()
    {

        Db::transaction(function () {

            $data1['zd1'] = 1;
            $data1['zd2'] = 1;
            $data1['zd3'] = 1;
            $data1['zd4'] = 1;

            Test1::create($data1);

            $data2['zd1'] = 1;
            $data2['zd2'] = 1;
            $data2['zd3'] = 1;

            Test2::create($data2);

        });
        return true;

    }
}